<a href="https://colab.research.google.com/github/Hugekyung/TIL/blob/master/python_basic/Pandas/Pandas_skills%5B4_7%5D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas skills  
1. Object Creation  
2. Viewing Data  
3. Selection  
4. Missing Data  
5. Operation  
6. Merge
7. Grouping  
8. Reshapeing  
10. Time Series  
11. Categoricals  
12. Plotting  
13. Getting Data In / Out  
14. Gotchas

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## 4.Missing Data (결측치)

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8])
dates = pd.date_range('20200801', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2020-08-01 -0.786870 -0.225762 -0.812988  2.014652
2020-08-02 -0.987273  0.345798 -0.197650  0.422491
2020-08-03 -1.283330  0.822143 -0.691145 -0.116606
2020-08-04 -3.278491  0.441366  0.119984  1.711084
2020-08-05 -0.831410  1.481111  0.639462  0.153449
2020-08-06  0.114699 -0.470691 -1.205253  1.023658

In [ ]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1 # 값을 안넣어준 부분은 NAN으로 설정됨
df1

                   A         B         C         D    E
2020-08-01 -0.786870 -0.225762 -0.812988  2.014652  1.0
2020-08-02 -0.987273  0.345798 -0.197650  0.422491  1.0
2020-08-03 -1.283330  0.822143 -0.691145 -0.116606  NaN
2020-08-04 -3.278491  0.441366  0.119984  1.711084  NaN

In [ ]:
# 결측치를 가지고 있는 행들 삭제
df1.dropna(how='any')

                   A         B         C         D    E
2020-08-01 -0.786870 -0.225762 -0.812988  2.014652  1.0
2020-08-02 -0.987273  0.345798 -0.197650  0.422491  1.0

In [ ]:
# 결측치를 채움
df1.fillna(value=5)

                   A         B         C         D    E
2020-08-01 -0.786870 -0.225762 -0.812988  2.014652  1.0
2020-08-02 -0.987273  0.345798 -0.197650  0.422491  1.0
2020-08-03 -1.283330  0.822143 -0.691145 -0.116606  5.0
2020-08-04 -3.278491  0.441366  0.119984  1.711084  5.0

In [ ]:
# 데이터프레임의 모든 값이 boolean형태로 표시되며, NaN인 값에만 True가 표시됨
pd.isna(df1)

                A      B      C      D      E
2020-08-01  False  False  False  False  False
2020-08-02  False  False  False  False  False
2020-08-03  False  False  False  False   True
2020-08-04  False  False  False  False   True

## 5.Operation (연산)

### Stats (통계)

In [ ]:
df.mean()

A   -1.175446
B    0.398994
C   -0.357932
D    0.868121
dtype: float64

In [ ]:
df.mean(1)

2020-08-01    0.047258
2020-08-02   -0.104158
2020-08-03   -0.317234
2020-08-04   -0.251514
2020-08-05    0.360653
2020-08-06   -0.134397
Freq: D, dtype: float64

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2020-08-01    NaN
2020-08-02    NaN
2020-08-03    1.0
2020-08-04    3.0
2020-08-05    5.0
2020-08-06    NaN
Freq: D, dtype: float64

In [ ]:
df.sub(s, axis='index')

                   A         B         C         D
2020-08-01       NaN       NaN       NaN       NaN
2020-08-02       NaN       NaN       NaN       NaN
2020-08-03 -2.283330 -0.177857 -1.691145 -1.116606
2020-08-04 -6.278491 -2.558634 -2.880016 -1.288916
2020-08-05 -5.831410 -3.518889 -4.360538 -4.846551
2020-08-06       NaN       NaN       NaN       NaN

### Apply (적용)

In [ ]:
df.apply(np.cumsum)

                   A         B         C         D
2020-08-01 -0.786870 -0.225762 -0.812988  2.014652
2020-08-02 -1.774144  0.120036 -1.010638  2.437143
2020-08-03 -3.057474  0.942179 -1.701783  2.320537
2020-08-04 -6.335965  1.383545 -1.581799  4.031621
2020-08-05 -7.167375  2.864656 -0.942337  4.185070
2020-08-06 -7.052676  2.393965 -2.147591  5.208728

In [ ]:
df.apply(lambda x: x.max() - x.min())

A    3.393190
B    1.951802
C    1.844715
D    2.131258
dtype: float64

### Histogramming (히스토그래밍)

In [ ]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    5
2    4
3    5
4    3
5    0
6    4
7    4
8    2
9    3
dtype: int64

In [ ]:
s.value_counts()

4    4
5    2
3    2
2    1
0    1
dtype: int64

### String Methods (문자열 메소드)

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [ ]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## 6.Merge (병합)

### Concat (연결)
결합 (join) / 병합 (merge) 형태의 연산에 대한 인덱스, 관계 대수 기능을 위한 다양한 형태의 논리를 포함한 Series, 데이터프레임, Panel 객체를 손쉽게 결합할 수 있도록 하는 다양한 기능을 pandas 에서 제공합니다.

In [ ]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.766139  0.957667 -0.981576 -1.507377
1  0.211101  0.173209 -0.275242 -0.284493
2 -0.186190  0.596660 -2.832474  0.112896
3 -0.396382 -0.290931  0.707907 -0.860971
4 -0.744246 -0.805994  0.194028  1.969735
5 -0.507878  0.269146  0.157614 -0.828002
6 -0.123147  0.319435 -1.348509  1.499334
7 -1.518120 -0.089457 -0.140052  0.268865
8 -0.045827 -1.222726  1.213730 -0.704472
9  1.144218 -0.366938  1.312275 -0.028745

In [ ]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.766139  0.957667 -0.981576 -1.507377
 1  0.211101  0.173209 -0.275242 -0.284493
 2 -0.186190  0.596660 -2.832474  0.112896,
           0         1         2         3
 3 -0.396382 -0.290931  0.707907 -0.860971
 4 -0.744246 -0.805994  0.194028  1.969735
 5 -0.507878  0.269146  0.157614 -0.828002
 6 -0.123147  0.319435 -1.348509  1.499334,
           0         1         2         3
 7 -1.518120 -0.089457 -0.140052  0.268865
 8 -0.045827 -1.222726  1.213730 -0.704472
 9  1.144218 -0.366938  1.312275 -0.028745]

In [ ]:
pd.concat(pieces)

          0         1         2         3
0  0.766139  0.957667 -0.981576 -1.507377
1  0.211101  0.173209 -0.275242 -0.284493
2 -0.186190  0.596660 -2.832474  0.112896
3 -0.396382 -0.290931  0.707907 -0.860971
4 -0.744246 -0.805994  0.194028  1.969735
5 -0.507878  0.269146  0.157614 -0.828002
6 -0.123147  0.319435 -1.348509  1.499334
7 -1.518120 -0.089457 -0.140052  0.268865
8 -0.045827 -1.222726  1.213730 -0.704472
9  1.144218 -0.366938  1.312275 -0.028745

### Join (결합)
SQL 방식으로 병합합니다.

In [ ]:
# 예시 1
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [ ]:
left

   key  lval
0  foo     1
1  foo     2

In [ ]:
right

   key  rval
0  foo     4
1  foo     5

In [ ]:
pd.merge(left, right, on='key') # 'key에 맞춰 병합

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [ ]:
# 예시 2
left = pd.DataFrame({'key' : ['foo', 'bar'], 'lval' : [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [ ]:
left

   key  lval
0  foo     1
1  bar     2

In [ ]:
right

   key  rval
0  foo     4
1  bar     5

In [ ]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append (추가)
데이터프레임에 행을 추가합니다.

In [ ]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -1.441190 -1.346198 -0.100529 -0.356427
1 -0.032873  2.192506 -1.007851 -0.852632
2 -0.263523 -1.099747  0.192007 -0.862608
3 -1.899158 -0.182434 -1.165538  0.616145
4 -1.696975  0.424822 -0.049474 -0.495790
5  0.150684  0.762326 -0.402758 -1.149296
6 -1.045834 -0.271387  0.638295 -0.021305
7 -1.754304  0.399365 -0.203484 -0.040058

In [ ]:
s = df.iloc[3] # 3번행 추출
s
#### loc과 iloc의 차이점?

A   -1.899158
B   -0.182434
C   -1.165538
D    0.616145
Name: 3, dtype: float64

In [ ]:
df.append(s, ignore_index=True) # 열 이름(column name) 무시하고 정수 번호 자동 부여 : ignore_index=True

          A         B         C         D
0 -1.441190 -1.346198 -0.100529 -0.356427
1 -0.032873  2.192506 -1.007851 -0.852632
2 -0.263523 -1.099747  0.192007 -0.862608
3 -1.899158 -0.182434 -1.165538  0.616145
4 -1.696975  0.424822 -0.049474 -0.495790
5  0.150684  0.762326 -0.402758 -1.149296
6 -1.045834 -0.271387  0.638295 -0.021305
7 -1.754304  0.399365 -0.203484 -0.040058
8 -1.899158 -0.182434 -1.165538  0.616145

## 7.Grouping (그룹화)
그룹화는 다음 단계 중 하나 이상을 포함하는 과정을 가리킵니다.

- 몇몇 기준에 따라 여러 그룹으로 데이터를 분할 (splitting)  
- 각 그룹에 독립적으로 함수를 적용 (applying)  
- 결과물들을 하나의 데이터 구조로 결합 (combining)

In [ ]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    })
df

     A      B         C         D
0  foo    one -1.728242 -1.589220
1  bar    one  2.012640  0.498976
2  foo    two -0.177634  1.424433
3  bar  three  0.400173 -0.481063
4  foo    two -1.756631  0.609311
5  bar    two  0.148527  0.939468
6  foo    one  0.252732 -0.089389
7  foo  three  0.821206 -0.739602

In [ ]:
# 생성된 데이터프레임을 그룹화한 후 각 그룹에 sum() 함수를 적용합니다.
df.groupby('A').sum()

            C         D
A
bar  2.561339  0.957381
foo -2.588569 -0.384467

In [ ]:
# 여러 열을 기준으로 그룹화하면 계층적 인덱스가 형성됩니다. 여기에도 sum 함수를 적용할 수 있습니다.
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    2.012640  0.498976
    three  0.400173 -0.481063
    two    0.148527  0.939468
foo one   -1.475510 -1.678609
    three  0.821206 -0.739602
    two   -1.934265  2.033744